# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'drud/ddev' 
tap 'derailed/k9s'
tap 'derailed/popeye'

# Cask Config
cask_args appdir: '/Applications'

# Common Stuff
brew 'bash' # Update outdated version for OSX
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'findutils' # Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'tree' # Display directories as trees
brew 'watch' # Executes a program periodically, showing output fullscreen
brew 'wget' #  Internet file retriever
brew 'zsh-completions' # Additional completion definitions for zsh
brew 'zsh'


# Git + GitHub
brew 'bfg' # Remove large files or passwords from Git history like git-filter-branch -> https://rtyley.github.io/bfg-repo-cleaner/
brew 'git-crypt' # Enable transparent encryption/decryption of files in a git repo
brew 'git-lfs' # Git extension for versioning large files
brew 'git'
brew 'grip' # GitHub Markdown previewer
brew 'hub' # Add GitHub support to git on the command-line
brew 'travis' # CLI for Travis CI


# Docker
brew 'dive' # Exploring each Layer in a Image


# Terraform 
brew 'terraform' # Tool to build, change, and version infrastructure


# K8s Stuff
brew 'helm' # Kubernetes package manager
brew 'k9s' # Kubernetes CLI To Manage Your Clusters In Style
brew 'krew' # Package manager for kubectl plugins
brew 'kubectx' # Tool that can switch between kubectl contexts easily and create aliases
brew 'kubernetes-cli' # Kubernetes cli - also known as: kubectl
brew 'kube-ps1' # Kubernetes prompt info for bash and zsh
brew 'popeye' # A Kubernetes Cluster Sanitizer
brew 'stern' # Tail multiple Kubernetes pods & their containers


# Java
brew 'ant' # Build Tool
brew 'maven'
brew 'gradle'
brew 'groovy'


# PHP
brew 'php'
brew 'ddev' #  A local PHP development environment system


# GO
brew 'go'
brew 'gox' # Go cross compile tool


# Python
brew 'python'
brew 'pyenv' # Python version management


# Ruby
brew 'ruby'
brew 'rbenv' # Ruby version manager


# Node.js 
brew 'node'


# AWS 
brew 'awscli'
brew 'aws-elasticbeanstalk'


# Azure Cloud
brew 'azure-cli'


# Utils
brew 'asciidoctor' #  Text processor and publishing toolchain for AsciiDoc
brew 'dnsmasq' # Lightweight DNS forwarder and DHCP server
brew 'gnu-sed' # GNU implementation of the famous stream editor
brew 'graphicsmagick' # Image processing tools collection
brew 'imagemagick' # Tools and libraries to manipulate images in many formats
brew 'iproute2mac' # CLI wrapper for basic network utilities on macOS - ip command
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'mackup' # Keep your Mac's application settings in sync
brew 'make' # Utility for directing compilation
brew 'mkcert' # Simple tool to make locally trusted development certificates
brew 'mtr' # 'traceroute' and 'ping' in a single tool
brew 'ocrmypdf' # Adds an OCR text layer to scanned PDF files
brew 'rename' # Perl-powered file rename script with many helpful built-ins
brew 'shunit2' # xUnit unit testing framework for Bourne-based shell scripts
brew 'telnet' # User interface to the TELNET protocol
brew 'thefuck' # Programatically correct mistyped console commands
brew 'tmux' # Terminal multiplexer
brew 'z' # Magic navigation z - jump around


# CTF 
# brew 'knock' # Unlock your Mac from yoir wrist with just a tap | DEPRECATED
brew 'aircrack-ng' # Next-generation aircrack with lots of new features
brew 'binutils' # GNU binary tools for native development
brew 'dns2tcp' # TCP over DNS tunnel
brew 'fcrackzip' # Zip password cracker
brew 'hydra' # Network logon cracker which supports many services
brew 'john' # Featureful UNIX password cracker
brew 'nmap' # Port scanning utility for large networks
brew 'sqlmap' # Penetration testing for SQL injection and database servers


# Applications
cask 'adobe-creative-cloud'
cask 'aerial'
cask 'alfred'
cask 'anaconda'
cask 'bartender'
cask 'boxcryptor'
cask 'catlight'
cask 'cleanmymac'
cask 'cyberduck'
cask 'cyberghost-vpn'
cask 'deepl'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'gemini'
cask 'hazel'
cask 'jetbrains-toolbox'
cask 'onedrive'
cask 'postman'
cask 'rescuetime'
cask 'spotify'
cask 'suspicious-package'
cask 'texstudio'
cask 'tor-browser'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus-outlook-plugin'
cask 'zoomus'
cask 'dbeaver-community'
cask 'mockoon'
cask 'pock'
cask 'mysqlworkbench'


# Quicklook
cask 'qlcolorcode' # QLColorCode Quick Look plugin for source code with syntax highlighting
cask 'qlmarkdown' # QuickLook generator for Markdown files
cask 'quicklook-json' # QuickLook-Json is a useful Quick Look plugin to preview JSON files
cask 'quicklook-csv' # QuickLook plugin for CSV files
cask 'qlstephen' # QuickLook plugin that lets you view plain text files without a file extension


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'